#1. ให้เขียนโปรแกรมเพื่อรับค่าตัวเลข 3 จำนวนจากนั้นให้หาค่าที่มีค่าน้อยที่สุดในสามจำนวนนั้น
'''
a = int(input())
b = int(input())
c = int(input())
abc = [a,b,c]
print(min(abc))'''
#2. ให้เขียนโปรแกรมเพื่อรับค่าตัวเลขจำนวนเต็ม ไปเรื่อยๆ จนกว่าผู้ใช้จะผู้ใช้จะพิมพ์ค่า 0 จากนั้นให้แสดงผลรวมของเลขจำนวนที่ผู้ใช้พิมพ์
'''
a = int(input())
sum = 0
while not a == 0:
    sum += a
    a = int(input())
print(sum)'''
#3.ให้เขียนโปรแกรมเพื่อรับค่าเลขจำนวนเต็มบวก 1 จำนวน (n) จากนั้นจะต้องรับค่าอีกจำนวน n ค่า จากนั้นให้หาผลบวกของตัวเลขคี่จากเลขทั้ง n จำนวนนั้น
'''
a = int(input())
sum = 0
for i in range(a):
    a = int(input())
    if not a % 2 == 0:
        sum += a
print(sum)'''
#ให้ L เป็นลำดับของเลขจำนวนเต็ม จำนวน n ตัว ให้หาลำดับของเลขที่มีค่าใกล้กับค่าเฉลี่ยมากที่สุด

sum = 0
avgOfL = 0
result = 0
min_result = 0
L = [1,2,3,4,5,6,7,8,9]
for i in range(len(L)):
    sum += L[i]
avgOfL = sum/len(L)
min_result = min([abs(i-avgOfL) for i in L])
for a in range(len(L)):
    if abs(L[a]-avgOfL) == min_result:
        print(L.index(L[a]))

#ให้ L เป็นลำดับของเลขจำนวนเต็มจำนวน n ตัวให้หาตำแหน่งของตัวเลขที่มีค่าที่มากที่สุดที่น้อยกว่าค่าเฉลี่ย
'''
sum = 0
avgOfL = 0
result = 0
min_result = 0
L = [569,981,728,739,150,301,416,125,68,847]
for i in range(len(L)):
    sum += L[i] #ผลรวม
    avgOfL = sum/len(L) #ค่าเฉลี่ย
for a in range(len(L)):
    if L[a]> avgOfL  :
        L[a] = 0
min_result = min([abs(i-avgOfL) for i in L])
for a in range(len(L)):
    if abs(L[a]-avgOfL) == min_result:
        print(L.index(L[a]),min_result,L[a])
'''
#ให้ L เป็นลำดับของเลขจำนวนเต็มจำนวน n ตัว
#ให้หาตำแหน่งเริ่มต้นของตัวเลข (ตั้งแต่ตำแหน่ง 0 ถึง n-3)
#  ที่มีเลขในลำดับถัดไปอีก 2 ลำดับ (รวมตัวเอง) ทั้งหมด 3 จำนวน เรียงจากน้อยไปหามาก
#เช่น 1,2,1,2,1,2,3,1,2,1
#ตอบ ตำแหน่งที่ 4 เพราะ ตำแหน่งที่ 4 มีค่าเป็น 1 และตำแหน่งที่ 5,6 มีค่าเป็น 2,3 ตามลำดับทำให้
#1,2,3 เป็นเลขที่เรียงกันจากน้อยไปหามากตำแหน่งแรก

